benchmark/ycsb/results/test.txt
/home/kernux/.jdks/azul-1.8.0_322/bin/java  -classpath /home/kernux/Documents/thesis/app-redis/benchmark/ycsb/conf:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/HdrHistogram-2.1.4.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/commons-pool2-2.4.2.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/core-0.17.0.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/jackson-core-asl-1.9.4.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/jedis-2.9.0.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=192.168.1.20 -p redis.port=6379
[OVERALL], RunTime(ms), 140
[OVERALL], Throughput(ops/sec), 7142.857142857143
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 371
[READ], AverageLatency(us), 75.64959568733154
[READ], MinLatency(us), 44
[READ], MaxLatency(us), 354
[READ], 95thPercentileLatency(us), 118
[READ], 99thPercentileLatency(us), 188
[READ], Return=OK, 371
[READ], Return=ERROR, 153
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 300.0
[CLEANUP], MinLatency(us), 300
[CLEANUP], MaxLatency(us), 300
[CLEANUP], 95thPercentileLatency(us), 300
[CLEANUP], 99thPercentileLatency(us), 300
[READ-FAILED], Operations, 153
[READ-FAILED], AverageLatency(us), 119.86928104575163
[READ-FAILED], MinLatency(us), 40
[READ-FAILED], MaxLatency(us), 9119
[READ-FAILED], 95thPercentileLatency(us), 81
[READ-FAILED], 99thPercentileLatency(us), 132
[UPDATE], Operations, 476
[UPDATE], AverageLatency(us), 102.41806722689076
[UPDATE], MinLatency(us), 51
[UPDATE], MaxLatency(us), 793
[UPDATE], 95thPercentileLatency(us), 154
[UPDATE], 99thPercentileLatency(us), 233
[UPDATE], Return=OK, 476